In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv(r'C:\Users\johnp\Downloads\sample.csv')

In [3]:
df = df.transpose().reset_index()

In [4]:
df

       index    0                 1
0   Rainfall  Age  Odometer Reading
1         35   35             35065
2         23   23             67443
3         12   14             23545
4         65   76             12323
5         34  NaN             72335
6        111  NaN               NaN
7         54  NaN               NaN
8       23.1  NaN               NaN
9         68  NaN               NaN
10        97  NaN               NaN

In [5]:
df = df.rename(columns={"index":"Monthly Rainfall",0:"Age",1:"Odometer Reading"})

In [6]:
df.dropna()

  Monthly Rainfall  Age  Odometer Reading
0         Rainfall  Age  Odometer Reading
1               35   35             35065
2               23   23             67443
3               12   14             23545
4               65   76             12323

In [7]:
hf = df.iloc[1:5,0:3]

In [8]:
hf = hf.reset_index().drop(columns="index")

In [9]:
hf

  Monthly Rainfall Age Odometer Reading
0               35  35            35065
1               23  23            67443
2               12  14            23545
3               65  76            12323

In [10]:
hf = hf.sort_values(by = ["Monthly Rainfall","Age"], ascending = True)

In [11]:
hf

  Monthly Rainfall Age Odometer Reading
2               12  14            23545
1               23  23            67443
0               35  35            35065
3               65  76            12323

In [12]:
np.mean(hf["Age"])

37.0

In [13]:
np.median(hf["Age"])

29.0

In [14]:
np.std(hf["Age"])

23.717082451262844

In [15]:
hf.Age.quantile([0.25,0.5,0.75])

0.25    20.75
0.50       29
0.75    45.25
Name: Age, dtype: object

In [1]:
import numpy as np
d = [10,20,30,40,50,60]
print(np.mean(d))

35.0